#include "bird.h"

int main()
{
    ios::sync_with_stdio(false);
    wcin.imbue(locale("C.UTF-8"));
    wcout.imbue(locale("C.UTF-8"));
    wstring database[][2] = {
        {L"亞洲輝椋鳥", L"城鎮和城市中大量分佈，牠們棲息於廢棄的建築物和樹木中，經常成群活動，被認為是最吵鬧的鳥類之一"},
        {L"紅鳩", L"全身覆蓋著亮眼的酒紅色羽毛，頭部至頸部則呈鼠灰色，後頸有一道明顯的黑色頸環，就像是脖子掛著頭戴式耳機一樣"},
        {L"金背鳩", L"因爲翅膀覆羽具備顯眼的紅褐色或金棕色邊緣，在陽光下閃爍金色光芒而得名"},
        {L"珠頸斑鳩", L"頸部後方有一塊明顯的黑色白點斑塊，像是戴了珍珠項鍊，是都市裡最常見的「咕顧估」"},
        {L"灰斑鳩", L"全身羽毛呈灰淺褐色，頸後有一條細長的黑環，就像是脖子掛著頭戴式耳機一樣"},
        {L"鴿", L"英文俗名「pigeons」和「dove」在中文可以譯成鴿或鳩，基本上，較小的叫dove，較大的叫pigeon"},
        {L"鳩", L"英文俗名「pigeons」和「dove」在中文可以譯成鴿或鳩，基本上，較小的叫dove，較大的叫pigeon"},
        {L"愛蓮野鴿", L"進擊的巨人主角，一言不合就地鳴"},
        {L"南南東", L"竈門炭治郎的鎹鴉（天王寺松右衛門）常用的任務指示方位"},
        {L"黑冠麻鷺", L"俗稱「大笨鳥」，在草地上常維持縮頭不動的姿勢，受驚嚇時會伸長脖子偽裝成樹枝"},
        {L"和尚鸚鵡", L"前額與胸部呈淺灰色，像披了一件僧侶的斗篷，故得名「和尚」"},
        {L"金剛鸚鵡", L"體型巨大的長尾鸚鵡，羽色極其鮮豔，智商高且壽命極長，能輕易咬碎堅硬的果殼"},
        {L"玄鳳鸚鵡", L"又稱雞尾鸚鵡，最明顯的特徵是頭頂的冠羽和臉頰兩側的橘色圓斑，看起來就像香蕉形狀的皮卡丘"},
        {L"凱克鸚鵡", L"鸚鵡界的「跳跳虎」，喜歡跳躍式前進，腹部羽毛雪白，性格頑皮愛玩"},
        {L"非洲灰鸚鵡", L"公認智商最高的鳥類之一，擅長模仿人聲與環境音，羽毛為灰色，尾羽則是鮮紅色"},
        {L"帝雉", L"一千塊背面的鳥，是台灣體型最大的特有種鳥類"},
        {L"台灣冠八哥", L"本土原生物種，嘴部為牙白色，目前因外來種八哥競爭，野外族群數量大幅減少"},
        {L"家八哥", L"外來種，眼睛周圍有鮮黃色裸皮，常與白尾八哥成群出現，競爭力極強"},
        {L"白尾八哥", L"外來種，都市裡最常見的八哥，嘴部為橘黃色，飛行時翅膀與尾部可見明顯白斑"},
        {L"夜鷹", L"常在深夜發出極其響亮的「啾——、啾——」鳴叫聲，可謂《今夜無人入睡》（也許有人將這個作品翻譯成《今晚誰都別睡》）"},
        {L"ERROR", L"Oops！未找到相關資訊，請更換關鍵字再次搜尋。"}
    };

    wstring search_str;
    int size = 21;
    wcout << L"歡迎使用《我所知道的禽類》搜尋引擎！" << endl;
    wcout << L"請輸入您要查找的關鍵字： ";
    getline(wcin, search_str);
    replying(database, size, search_str);
    return 0;
}
